{
  "materials": [
    {
      "material_id": "1",
      "synthesis": {
        "chemicals_used": "manganese nitrate hexahydrate (287 mg, 1 mmol), 2-hydroxymethylpyridine (218 mg, 2 mmol), tetraethylammonium hydroxide (20 wt % water solution, 736 mg, 1 mmol), sodium dicyanamide (89 mg, 1 mmol)",
        "solvents": "acetonitrile (20 mL), diglyme (40 mL)",
        "equipment": "narrow glass tube",
        "procedure": "To an acetonitrile solution of manganese nitrate hexahydrate, 2-hydroxymethylpyridine and tetraethylammonium hydroxide were added and stirred for 1 h at room temperature. Sodium dicyanamide was then added and the solution was further stirred for 1 h. The resulting solution was filtered, carefully layered on diglyme in a narrow glass tube, and left to stand for several days to form brown rectangular crystals.",
        "yield": "86 mg, 29% (based on Mn)"
      }
    },
    {
      "material_id": "2",
      "synthesis": {
        "chemicals_used": "manganese perchlorate hexahydrate (724 mg, 2 mmol), 2-hydroxymethylpyridine (546 mg, 5 mmol), tetraethylammonium hydroxide (20 wt % water solution, 1.472 g, 2 mmol), pyridine-2,6-dimethanol (139 mg, 1 mmol), sodium dicyanamide (89 mg, 1 mmol)",
        "solvents": "acetonitrile (40 mL), diglyme (80 mL)",
        "equipment": "narrow glass tube",
        "procedure": "To an acetonitrile solution of manganese perchlorate hexahydrate, 2-hydroxymethylpyridine and tetraethylammonium hydroxide were added and stirred for 1 h. Solids of both pyridine-2,6-dimethanol and sodium dicyanamide were added to the solution that was then further stirred for 1 h. The resulting solution was filtered, carefully layered on diglyme in a narrow glass tube, and left to stand for several days to form red-brown rectangular crystals.",
        "yield": "435 mg, 63% (based on Mn)"
      }
    },
    {
      "material_id": "3",
      "synthesis": {
        "chemicals_used": "[Mn4(hmp)6Br2(H2O)2]Br2 (52 mg, 0.04 mmol), sodium dicyanamide (7 mg, 0.08 mmol)",
        "solvents": "methanol (5 mL), tetrahydrofuran (10 mL)",
        "equipment": "narrow glass tube",
        "procedure": "A methanol solution containing [Mn4(hmp)6Br2(H2O)2]Br2 and sodium dicyanamide was stirred for 1 h at room temperature. The resulting solution was filtered, carefully layered on tetrahydrofuran in a narrow glass tube, and left to stand for several days to form brown rectangular crystals.",
        "yield": "29 mg, 62% (based on Mn)"
      }
    },
    {
      "material_id": "4",
      "synthesis": {
        "chemicals_used": "manganese perchlorate hexahydrate (499 mg, 1.38 mmol), 2-hydroxymethylpyridine (379 mg, 3.47 mmol), tetraethylammonium hydroxide (20 wt % water solution, 531 mg, 0.72 mmol), sodium dicyanamide (51 mg, 0.57 mmol)",
        "solvents": "acetonitrile (20 mL), diglyme (40 mL)",
        "equipment": "narrow glass tube",
        "procedure": "To an acetonitrile solution of manganese perchlorate hexahydrate, 2-hydroxymethylpyridine and tetraethylammonium hydroxide were added and stirred for 1 h. Sodium dicyanamide was then added and the solution was further stirred for 1 h. The resulting solution was filtered, carefully layered on diglyme in a narrow glass tube, and left to stand for several days to form red-brown rectangular crystals.",
        "yield": "242 mg, 58% (based on Mn)"
      }
    }
  ]
}
