{
  "materials": [
    {
      "material_id": "1",
      "synthesis": {
        "general": "Complex 1 was obtained as previously described from Mn(ClO4)2·6H2O and 2-hydroxymethylpyridine (Hhmp) in acetonitrile."
      }
    },
    {
      "material_id": "2",
      "synthesis": {
        "general": "This compound slowly forms (ca. 2−3 months) as red crystals from crystals of 1 left in their mother liquor. It is also obtained by putting crystals of 1 in an acetonitrile/water mixture. The crystals of 2 are highly sensitive to solvent loss."
      }
    },
    {
      "material_id": "3",
      "synthesis": {
        "chemicals_used": "Mn(ClO4)2·6H2O (0.500 g, 1.38 mmol), Hhmp (0.378 g, 3.45 mmol), TEAOH (0.530 g, 0.72 mmol of a 20 wt % water solution), NaNO3 (0.049 g, 0.58 mmol)",
        "solvent": "CH3CN (20 mL)",
        "procedure": "Mn(ClO4)2·6H2O and Hhmp were dissolved in CH3CN with stirring. TEAOH was added dropwise, followed by solid NaNO3. The red-brown solution was stirred for 1 h at room temperature. After filtration, the solution was kept undisturbed in a flask for slow evaporation. Red-brown prismatic crystals of 3 were isolated within a day to a week.",
        "washing_method": "Washed with CH3CN",
        "drying_method": "Deposited in vacuo",
        "yield": "51%"
      }
    },
    {
      "material_id": "4",
      "synthesis": {
        "chemicals_used": "[Mn4(hmp)6(CH3CN)2(H2O)4](ClO4)4·2CH3CN (1) (0.150 g), Hhmp (44 mg, 0.40 mmol)",
        "solvent": "Acetonitrile (10 mL for dissolving 1), diethyl ether (20 mL containing Hhmp)",
        "procedure": "1 was dissolved in acetonitrile. A diethyl ether solution containing Hhmp was gently added to the solution in a test tube, which was then sealed and kept undisturbed. After about one week, a kinetic product formed as hexagonal dark-red crystals. Keeping the tube undisturbed without collecting the crystals of the kinetic species, a thermodynamic product was obtained after about one month as dark-pink crystals of 4.",
        "washing_method": "Washed with acetonitrile",
        "drying_method": "Dried in air",
        "yield": "41%"
      }
    },
    {
      "material_id": "5",
      "synthesis": {
        "chemicals_used": "Mn(ClO4)2·6H2O (500 mg, 1.38 mmol), Hhmp (335 μL, 0.378 g, 3.45 mmol), TEAOH (510 μL of a 20 wt % aqueous solution, 530 mg, 0.72 mmol), NaN3 (76 mg, 1.18 mmol)",
        "solvent": "Acetonitrile (10 mL for dissolving Mn(ClO4)2·6H2O), diethyl ether (for slow diffusion)",
        "procedure": "Mn(ClO4)2·6H2O was dissolved in acetonitrile, Hhmp was added, followed by TEAOH, turning the solution dark red. After 1 min stirring, NaN3 was added and the solution was stirred for 1 h in a closed beaker. After filtration, 5 mL of the filtrate was put in a 150-mL beaker that was sealed in a flask containing diethyl ether. Upon slow diffusion of ether into the unperturbed solution, cubic salmon-colored crystals started to appear after one week.",
        "washing_method": "Washed with an acetonitrile/toluene mixture (5/3)",
        "drying_method": "Dried in air",
        "yield": "79%"
      }
    }
  ]
}
